# Pandas - Operations

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'col1': [1,2,3,4],
                  'col2': [444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

In [3]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Finding Unique value

In [7]:
df['col2'].unique() #only unique values

array([444, 555, 666], dtype=int64)

In [9]:
len(df['col2'].unique()) # no. of unique values

3

In [10]:
df['col2'].nunique()

3

In [12]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [13]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

## apply() built-in function

In [14]:
def times2(x):
    return x * 2

In [15]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [16]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [17]:
df['col3'].apply(times2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [18]:
df.apply(times2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [20]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

### Effective when we use lambda expression for apply()

In [21]:
df['col1'].apply(lambda x : x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [22]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [25]:
df.index

RangeIndex(start=0, stop=4, step=1)

### Sorting

In [24]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [28]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

### Null

In [29]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [30]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

In [31]:
data

{'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
 'B': ['one', 'one', 'two', 'two', 'one', 'one'],
 'C': ['x', 'y', 'x', 'y', 'x', 'y'],
 'D': [1, 3, 2, 5, 4, 1]}

In [33]:
yf = pd.DataFrame(data)

In [34]:
yf

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

### pivot_table()

In [36]:
yf.pivot_table(values='D',index=['A','B'])

           D
A   B
bar one  2.5
    two  5.0
foo one  2.0
    two  2.0

In [37]:
yf.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN